public class dz1_1 {
    public static void main(String[] args) {
        //Написать метод вычисляющий выражение a * (b + (c / d)) и возвращающий результат,
        //где a, b, c, d – аргументы этого метода, имеющие тип float.
        int a = 4,  b = 12,  c =76,  d = 7;
        int e = a * (b + (c / d));
        System.out.println((float)e);


    }






}
